Revit 2026 API

# GenericGenericGlossiness Property

---

The property labeled "Glossiness" from the "Generic" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string GenericGlossiness { get; }
```
```vb
Public Shared ReadOnly Property GenericGlossiness As String
	Get
```
```cpp
public:
static property String^ GenericGlossiness {
	String^ get ();
}
```
```fsharp
static member GenericGlossiness : string with get
```

#### Property Value

String

This property is of type "AssetPropertyDouble". This property allows a connected asset.

#### Reference

Generic Class

Autodesk.Revit.DB.Visual Namespace